[  
    {  
        "code":"100",
        "meaning":"Continue",
        "description":"This means that the server has received the request headers, and that the client should proceed to send the request body (in the case of a request for which a body needs to be sent; for example, a POST request). If the request body is large, sending it to a server when a request has already been rejected based upon inappropriate headers is inefficient. To have a server check if the request could be accepted based on the request's headers alone, a client must send Expect: 100-continue as a header in its initial request and check if a 100 Continue status code is received in response before continuing (or receive 417 Expectation Failed and not continue).",
        "imageurl":"https://httpdog.com/images/100.jpg"
    },
    {  
        "code":"101",
        "meaning":"Switching Protocols",
        "description":"This means the requester has asked the server to switch protocols and the server is acknowledging that it will do so.",
        "imageurl":"https://httpdog.com/images/101.jpg"
    },
    {  
        "code":"102",
        "meaning":"Processing",
        "description":"(WebDAV; RFC 2518) As a WebDAV request may contain many sub-requests involving file operations, it may take a long time to complete the request. This code indicates that the server has received and is processing the request, but no response is available yet. This prevents the client from timing out and assuming the request was lost.",
        "imageurl":"https://httpdog.com/images/102.jpg"
    },
    {  
        "code":"200",
        "meaning":"OK",
        "description":"Standard response for successful HTTP requests. The actual response will depend on the request method used. In a GET request, the response will contain an entity corresponding to the requested resource. In a POST request the response will contain an entity describing or containing the result of the action.",
        "imageurl":"https://httpdog.com/images/200.jpg"
    },
    {  
        "code":"201",
        "meaning":"Created",
        "description":"The request has been fulfilled and resulted in a new resource being created.",
        "imageurl":"https://httpdog.com/images/201.jpg"
    },
    {  
        "code":"202",
        "meaning":"Accepted",
        "description":"The request has been accepted for processing, but the processing has not been completed. The request might or might not eventually be acted upon, as it might be disallowed when processing actually takes place.",
        "imageurl":"https://httpdog.com/images/202.jpg"
    },
    {  
        "code":"203",
        "meaning":"Non-Authoritative Information",
        "description":"(since HTTP/1.1) The server successfully processed the request, but is returning information that may be from another source.",
        "imageurl":"https://httpdog.com/images/203.jpg"
    },
    {  
        "code":"204",
        "meaning":"No Content",
        "description":"The server successfully processed the request, but is not returning any content.",
        "imageurl":"https://httpdog.com/images/204.jpg"
    },
    {  
        "code":"205",
        "meaning":"Reset Content",
        "description":"The server successfully processed the request, but is not returning any content. Unlike a 204 response, this response requires that the requester reset the document view.",
        "imageurl":"https://httpdog.com/images/205.jpg"
    },
    {  
        "code":"206",
        "meaning":"Partial Content",
        "description":"The server is delivering only part of the resource due to a range header sent by the client. The range header is used by tools like wget to enable resuming of interrupted downloads, or split a download into multiple simultaneous streams.",
        "imageurl":"https://httpdog.com/images/206.jpg"
    },
    {  
        "code":"207",
        "meaning":"Multi-Status",
        "description":"(WebDAV; RFC 4918) The message body that follows is an XML message and can contain a number of separate response codes, depending on how many sub-requests were made.",
        "imageurl":"https://httpdog.com/images/207.jpg"
    },
    {  
        "code":"208",
        "meaning":"Already Reported",
        "description":"(WebDAV; RFC 5842) The members of a DAV binding have already been enumerated in a previous reply to this request, and are not being included again.",
        "imageurl":"https://httpdog.com/images/208.jpg"
    },
    {  
        "code":"226",
        "meaning":"IM Used",
        "description":"(RFC 3229) The server has fulfilled a GET request for the resource, and the response is a representation of the result of one or more instance-manipulations applied to the current instance. ",
        "imageurl":"https://httpdog.com/images/226.jpg"
    },
    {  
        "code":"300",
        "meaning":"Multiple Choices",
        "description":"Indicates multiple options for the resource that the client may follow. It, for instance, could be used to present different format options for video, list files with different extensions, or word sense disambiguation.",
        "imageurl":"https://httpdog.com/images/300.jpg"
    },
    {  
        "code":"301",
        "meaning":"Moved Permanently",
        "description":"This and all future requests should be directed to the given URI.",
        "imageurl":"https://httpdog.com/images/301.jpg"
    },
    {  
        "code":"302",
        "meaning":"Found",
        "description":"This is an example of industry practice contradicting the standard. The HTTP/1.0 specification (RFC 1945) required the client to perform a temporary redirect (the original describing phrase was Moved Temporarily), but popular browsers implemented 302 with the functionality of a 303 See Other. Therefore, HTTP/1.1 added status codes 303 and 307 to distinguish between the two behaviours. However, some Web applications and frameworks use the 302 status code as if it were the 303.[citation needed]",
        "imageurl":"https://httpdog.com/images/302.jpg"
    },
    {  
        "code":"303",
        "meaning":"See Other",
        "description":"(since HTTP/1.1) The response to the request can be found under another URI using a GET method. When received in response to a POST (or PUT/DELETE), it should be assumed that the server has received the data and the redirect should be issued with a separate GET message.",
        "imageurl":"https://httpdog.com/images/303.jpg"
    },
    {  
        "code":"304",
        "meaning":"Not Modified",
        "description":"Indicates the resource has not been modified since last requested. Typically, the HTTP client provides a header like the If-Modified-Since header to provide a time against which to compare. Using this saves bandwidth and reprocessing on both the server and client, as only the header data must be sent and received in comparison to the entirety of the page being re-processed by the server, then sent again using more bandwidth of the server and client.",
        "imageurl":"https://httpdog.com/images/304.jpg"
    },
    {  
        "code":"305",
        "meaning":"Use Proxy",
        "description":"(since HTTP/1.1) Many HTTP clients (such as Mozilla and Internet Explorer) do not correctly handle responses with this status code, primarily for security reasons.",
        "imageurl":"https://httpdog.com/images/305.jpg"
    },
    {  
        "code":"306",
        "meaning":"Switch Proxy",
        "description":"No longer used. Originally meant Subsequent requests should use the specified proxy.",
        "imageurl":"https://httpdog.com/images/306.jpg"
    },
    {  
        "code":"307",
        "meaning":"Temporary Redirect",
        "description":"(since HTTP/1.1) In this case, the request should be repeated with another URI; however, future requests can still use the original URI. In contrast to 302, the request method should not be changed when reissuing the original request. For instance, a POST request must be repeated using another POST request.",
        "imageurl":"https://httpdog.com/images/307.jpg"
    },
    {  
        "code":"308",
        "meaning":"Permanent Redirect",
        "description":"(experimental Internet-Draft) The request, and all future requests should be repeated using another URI. 307 and 308 (as proposed) parallel the behaviours of 302 and 301, but do not require the HTTP method to change. So, for example, submitting a form to a permanently redirected resource may continue smoothly.",
        "imageurl":"https://httpdog.com/images/308.jpg"
    },
    {  
        "code":"400",
        "meaning":"Bad Request",
        "description":"The request cannot be fulfilled due to bad syntax.",
        "imageurl":"https://httpdog.com/images/400.jpg"
    },
    {  
        "code":"401",
        "meaning":"Unauthorized",
        "description":"Similar to 403 Forbidden, but specifically for use when authentication is possible but has failed or not yet been provided. The response must include a WWW-Authenticate header field containing a challenge applicable to the requested resource. See Basic access authentication and Digest access authentication.",
        "imageurl":"https://httpdog.com/images/401.jpg"
    },
    {  
        "code":"402",
        "meaning":"Payment Required",
        "description":"Reserved for future use. The original intention was that this code might be used as part of some form of digital cash or micropayment scheme, but that has not happened, and this code is not usually used. As an example of its use, however, Apple's MobileMe service generates a 402 error (httpStatusCode:402 in the Mac OS X Console log) if the MobileMe account is delinquent.[citation needed]",
        "imageurl":"https://httpdog.com/images/402.jpg"
    },
    {  
        "code":"403",
        "meaning":"Forbidden",
        "description":"The request was a legal request, but the server is refusing to respond to it. Unlike a 401 Unauthorized response, authenticating will make no difference.",
        "imageurl":"https://httpdog.com/images/403.jpg"
    },
    {  
        "code":"404",
        "meaning":"Not Found",
        "description":"The requested resource could not be found but may be available again in the future. Subsequent requests by the client are permissible.",
        "imageurl":"https://httpdog.com/images/404.jpg"
    },
    {  
        "code":"405",
        "meaning":"Method Not Allowed",
        "description":"A request was made of a resource using a request method not supported by that resource; for example, using GET on a form which requires data to be presented via POST, or using PUT on a read-only resource.",
        "imageurl":"https://httpdog.com/images/405.jpg"
    },
    {  
        "code":"406",
        "meaning":"Not Acceptable",
        "description":"The requested resource is only capable of generating content not acceptable according to the Accept headers sent in the request.",
        "imageurl":"https://httpdog.com/images/406.jpg"
    },
    {  
        "code":"407",
        "meaning":"Proxy Authentication Required",
        "description":"The client must first authenticate itself with the proxy.",
        "imageurl":"https://httpdog.com/images/407.jpg"
    },
    {  
        "code":"408",
        "meaning":"Request Timeout",
        "description":"The server timed out waiting for the request. According to W3 HTTP specifications: The client did not produce a request within the time that the server was prepared to wait. The client MAY repeat the request without modifications at any later time.",
        "imageurl":"https://httpdog.com/images/408.jpg"
    },
    {  
        "code":"409",
        "meaning":"Conflict",
        "description":"Indicates that the request could not be processed because of conflict in the request, such as an edit conflict.",
        "imageurl":"https://httpdog.com/images/409.jpg"
    },
    {  
        "code":"410",
        "meaning":"Gone",
        "description":"Indicates that the resource requested is no longer available and will not be available again. This should be used when a resource has been intentionally removed and the resource should be purged. Upon receiving a 410 status code, the client should not request the resource again in the future. Clients such as search engines should remove the resource from their indices. Most use cases do not require clients and search engines to purge the resource, and a 404 Not Found may be used instead.",
        "imageurl":"https://httpdog.com/images/410.jpg"
    },
    {  
        "code":"411",
        "meaning":"Length Required",
        "description":"The request did not specify the length of its content, which is required by the requested resource.",
        "imageurl":"https://httpdog.com/images/411.jpg"
    },
    {  
        "code":"412",
        "meaning":"Precondition Failed",
        "description":"The server does not meet one of the preconditions that the requester put on the request.",
        "imageurl":"https://httpdog.com/images/412.jpg"
    },
    {  
        "code":"413",
        "meaning":"Request Entity Too Large",
        "description":"The request is larger than the server is willing or able to process.",
        "imageurl":"https://httpdog.com/images/413.jpg"
    },
    {  
        "code":"414",
        "meaning":"Request-URI Too Long",
        "description":"The URI provided was too long for the server to process.",
        "imageurl":"https://httpdog.com/images/414.jpg"
    },
    {  
        "code":"415",
        "meaning":"Unsupported Media Type",
        "description":"The request entity has a media type which the server or resource does not support. For example, the client uploads an image as image/svg+xml, but the server requires that images use a different format.",
        "imageurl":"https://httpdog.com/images/415.jpg"
    },
    {  
        "code":"416",
        "meaning":"Requested Range Not Satisfiable",
        "description":"The client has asked for a portion of the file, but the server cannot supply that portion. For example, if the client asked for a part of the file that lies beyond the end of the file.",
        "imageurl":"https://httpdog.com/images/416.jpg"
    },
    {  
        "code":"417",
        "meaning":"Expectation Failed",
        "description":"The server cannot meet the requirements of the Expect request-header field.",
        "imageurl":"https://httpdog.com/images/417.jpg"
    },
    {  
        "code":"418",
        "meaning":"I’m a teapot",
        "description":"(RFC 2324) This code was defined in 1998 as one of the traditional IETF April Fools jokes, in RFC 2324, Hyper Text Coffee Pot Control Protocol, and is not expected to be implemented by actual HTTP servers. However, known implementations do exist.",
        "imageurl":"https://httpdog.com/images/418.jpg"
    },
    {  
        "code":"420",
        "meaning":"Enhance Your Calm",
        "description":"(Twitter) Returned by the Twitter Search and Trends API when the client is being rate limited. Likely a reference to this number's association with marijuana. Other services may wish to implement the 429 Too Many Requests response code instead. The phrase Enhance Your Calm is a reference to Demolition Man (film). In the film, Sylvester Stallone's character John Spartan is a hot-head in a generally more subdued future, and is regularly told to Enhance your calm rather than a more common phrase like calm down.",
        "imageurl":"https://httpdog.com/images/420.jpg"
    },
    {  
        "code":"422",
        "meaning":"Unprocessable Entity",
        "description":"(WebDAV; RFC 4918) The request was well-formed but was unable to be followed due to semantic errors.",
        "imageurl":"https://httpdog.com/images/422.jpg"
    },
    {  
        "code":"423",
        "meaning":"Locked",
        "description":"(WebDAV; RFC 4918) The resource that is being accessed is locked.",
        "imageurl":"https://httpdog.com/images/423.jpg"
    },
    {  
        "code":"424",
        "meaning":"Failed Dependency",
        "description":"(WebDAV; RFC 4918) The request failed due to failure of a previous request (e.g. a PROPPATCH).",
        "imageurl":"https://httpdog.com/images/424.jpg"
    },
    {  
        "code":"424",
        "meaning":"Method Failure",
        "description":"(WebDAV) Indicates the method was not executed on a particular resource within its scope because some part of the method's execution failed causing the entire method to be aborted.",
        "imageurl":"https://httpdog.com/images/424.jpg"
    },
    {  
        "code":"425",
        "meaning":"Unordered Collection",
        "description":"(Internet draft) Defined in drafts of WebDAV Advanced Collections Protocol, but not present in Web Distributed Authoring and Versioning (WebDAV) Ordered Collections Protocol.",
        "imageurl":"https://httpdog.com/images/425.jpg"
    },
    {  
        "code":"426",
        "meaning":"Upgrade Required",
        "description":"(RFC 2817) The client should switch to a different protocol such as TLS/1.0.",
        "imageurl":"https://httpdog.com/images/426.jpg"
    },
    {  
        "code":"428",
        "meaning":"Precondition Required",
        "description":"(RFC 6585) The origin server requires the request to be conditional. Intended to prevent the 'lost update' problem, where a client GETs a resource's state, modifies it, and PUTs it back to the server, when meanwhile a third party has modified the state on the server, leading to a conflict.",
        "imageurl":"https://httpdog.com/images/428.jpg"
    },
    {  
        "code":"429",
        "meaning":"Too Many Requests",
        "description":"(RFC 6585) The user has sent too many requests in a given amount of time. Intended for use with rate limiting schemes.",
        "imageurl":"https://httpdog.com/images/429.jpg"
    },
    {  
        "code":"431",
        "meaning":"Request Header Fields Too Large",
        "description":"(RFC 6585) The server is unwilling to process the request because either an individual header field, or all the header fields collectively, are too large.",
        "imageurl":"https://httpdog.com/images/431.jpg"
    },
    {  
        "code":"444",
        "meaning":"No Response",
        "description":"(Nginx) Used in Nginx logs to indicate that the server has returned no information to the client and closed the connection (useful as a deterrent for malware).",
        "imageurl":"https://httpdog.com/images/444.jpg"
    },
    {  
        "code":"449",
        "meaning":"Retry With",
        "description":"(Microsoft) A Microsoft extension. The request should be retried after performing the appropriate action. Often search-engines or custom applications will ignore required parameters. Where no default action is appropriate, the Aviongoo website sends a 'HTTP/1.1 449 Retry with valid parameters: param1, param2, . . .' response. The applications may choose to learn, or not.",
        "imageurl":"https://httpdog.com/images/449.jpg"
    },
    {  
        "code":"450",
        "meaning":"Blocked by Windows Parental Controls",
        "description":"(Microsoft) A Microsoft extension. This error is given when Windows Parental Controls are turned on and are blocking access to the given webpage.",
        "imageurl":"https://httpdog.com/images/450.jpg"
    },
    {  
        "code":"451",
        "meaning":"Unavailable For Legal Reasons",
        "description":"(Internet draft) Defined in the internet draft 'A New HTTP Status Code for Legally-restricted Resources',. Intended to be used when resource access is denied for legal reasons, e.g. censorship or government-mandated blocked access. Likely a reference to the 1953 dystopian novel Fahrenheit 451, where books are outlawed.",
        "imageurl":"https://httpdog.com/images/451.jpg"
    },
    {  
        "code":"499",
        "meaning":"Client Closed Request",
        "description":"(Nginx) Used in Nginx logs to indicate when the connection has been closed by client while the server is still processing its request, making server unable to send a status code back.",
        "imageurl":"https://httpdog.com/images/499.jpg"
    },
    {  
        "code":"500",
        "meaning":"Internal Server Error",
        "description":"A generic error message, given when no more specific message is suitable.",
        "imageurl":"https://httpdog.com/images/500.jpg"
    },
    {  
        "code":"501",
        "meaning":"Not Implemented",
        "description":"The server either does not recognise the request method, or it lacks the ability to fulfill the request.",
        "imageurl":"https://httpdog.com/images/501.jpg"
    },
    {  
        "code":"502",
        "meaning":"Bad Gateway",
        "description":"The server was acting as a gateway or proxy and received an invalid response from the upstream server.",
        "imageurl":"https://httpdog.com/images/502.jpg"
    },
    {  
        "code":"503",
        "meaning":"Service Unavailable",
        "description":"The server is currently unavailable (because it is overloaded or down for maintenance). Generally, this is a temporary state.",
        "imageurl":"https://httpdog.com/images/503.jpg"
    },
    {  
        "code":"504",
        "meaning":"Gateway Timeout",
        "description":"The server was acting as a gateway or proxy and did not receive a timely response from the upstream server.",
        "imageurl":"https://httpdog.com/images/504.jpg"
    },
    {  
        "code":"505",
        "meaning":"HTTP Version Not Supported",
        "description":"The server does not support the HTTP protocol version used in the request.",
        "imageurl":"https://httpdog.com/images/505.jpg"
    },
    {  
        "code":"506",
        "meaning":"Variant Also Negotiates",
        "description":"(RFC 2295) Transparent content negotiation for the request results in a circular reference.",
        "imageurl":"https://httpdog.com/images/506.jpg"
    },
    {  
        "code":"507",
        "meaning":"Insufficient Storage",
        "description":"(WebDAV; RFC 4918) The server is unable to store the representation needed to complete the request.",
        "imageurl":"https://httpdog.com/images/507.jpg"
    },
    {  
        "code":"508",
        "meaning":"Loop Detected",
        "description":"(WebDAV; RFC 5842) The server detected an infinite loop while processing the request (sent in lieu of 208).",
        "imageurl":"https://httpdog.com/images/508.jpg"
    },
    {  
        "code":"509",
        "meaning":"Bandwidth Limit Exceeded",
        "description":"(Apache bw/limited extension) This status code, while used by many servers, is not specified in any RFCs.",
        "imageurl":"https://httpdog.com/images/509.jpg"
    },
    {  
        "code":"510",
        "meaning":"Not Extended",
        "description":"(RFC 2774) Further extensions to the request are required for the server to fulfill it.",
        "imageurl":"https://httpdog.com/images/510.jpg"
    },
    {  
        "code":"511",
        "meaning":"Network Authentication Required",
        "description":"(RFC 6585) The client needs to authenticate to gain network access. Intended for use by intercepting proxies used to control access to the network (e.g. 'captive portals' used to require agreement to Terms of Service before granting full Internet access via a Wi-Fi hotspot).",
        "imageurl":"https://httpdog.com/images/511.jpg"
    },
    {  
        "code":"598",
        "meaning":"Network read timeout error",
        "description":"(Unknown) This status code is not specified in any RFCs, but is used by Microsoft Corp. HTTP proxies to signal a network read timeout behind the proxy to a client in front of the proxy.",
        "imageurl":"https://httpdog.com/images/598.jpg"
    },
    {  
        "code":"599",
        "meaning":"Network connect timeout error",
        "description":"This status code is not specified in any RFCs, but is used by Microsoft Corp. HTTP proxies to signal a network connect timeout behind the proxy to a client in front of the proxy."
    }
]